In [ ]:
DATA WRANGLING

In [1]:
import numpy as  np 
import pandas as pd

In [5]:
df=pd.DataFrame([["Shahid",80],["Anas",75]],columns=["Name","Marks"])
df

     Name  Marks
0  Shahid     80
1    Anas     75

In [6]:
df2=pd.DataFrame([["Akshay",70],["Sonal",92]],columns=["Name","Marks"])
df2

     Name  Marks
0  Akshay     70
1   Sonal     92

In [8]:
outer_merge=pd.merge(df,df2,on="Name",how="outer")
outer_merge

     Name  Marks_x  Marks_y
0  Akshay      NaN     70.0
1    Anas     75.0      NaN
2  Shahid     80.0      NaN
3   Sonal      NaN     92.0

In [10]:
inner_df=pd.merge(df,df2,on="Name",how="inner")
inner_df

Empty DataFrame
Columns: [Name, Marks_x, Marks_y]
Index: []

In [13]:
concat=pd.concat([df,df2],ignore_index=True)

concat

     Name  Marks
0  Shahid     80
1    Anas     75
2  Akshay     70
3   Sonal     92